In [1]:
from sqlalchemy import create_engine

In [2]:
import pandas as pd

In [3]:
engine = create_engine('sqlite:///sqlite_db_pythonsqlite.db')

In [4]:
table_names = engine.table_names()
print(table_names)

['Bookings', 'Facilities', 'Members']

In [5]:
query = 'SELECT * FROM Bookings'

Bookings - bookid, facid, memid, starttime, slots

Facilities - facid, name, membercost, guestcost, initialoutlay, monthlymaintenance

Members - memid, surname, firstname, address, zipcode, telephone, recommendby, joindate

Q10: Produce a list of facilities with a total revenue less than 1000.
The output of facility name and total revenue, sorted by revenue. Remember
that there's a different cost for guests and members!

In [6]:
q10_query = '''
SELECT revenue.name AS 'Facility', revenue.revs AS 'Total Revenue'
FROM (SELECT 
 	f.name AS name,
 	SUM(CASE 
	WHEN b.memid = 0
    THEN f.guestcost*b.slots
    WHEN b.memid != 0
    THEN f.membercost*b.slots END) AS revs
	FROM Bookings as b
	LEFT JOIN Facilities as f
	ON b.facid=f.facid
    GROUP BY f.name) AS revenue
WHERE revenue.revs < 1000
GROUP BY revenue.name
ORDER BY revenue.revs;'''

In [7]:
with engine.connect() as con:
    rs = con.execute(query)
    df = pd.DataFrame(rs.fetchall())
    df.columns = rs.keys()
print(df)

      bookid  facid  memid            starttime  slots
0          0      3      1  2012-07-03 11:00:00      2
1          1      4      1  2012-07-03 08:00:00      2
2          2      6      0  2012-07-03 18:00:00      2
3          3      7      1  2012-07-03 19:00:00      2
4          4      8      1  2012-07-03 10:00:00      1
...      ...    ...    ...                  ...    ...
4038    4038      8     29  2012-09-30 16:30:00      2
4039    4039      8     29  2012-09-30 18:00:00      1
4040    4040      8     21  2012-09-30 18:30:00      1
4041    4041      8     16  2012-09-30 19:00:00      1
4042    4042      8     29  2012-09-30 19:30:00      1

[4043 rows x 5 columns]

In [8]:
with engine.connect() as con:
    rs = con.execute(q10_query)
    df = pd.DataFrame(rs.fetchall())
    df.columns = rs.keys()
print(df)

        Facility  Total Revenue
0   Table Tennis            180
1  Snooker Table            240
2     Pool Table            270

Q11: Produce a report of members and who recommended them in alphabetic surname,firstname order

In [9]:
q11_query = '''
SELECT m1.surname, m1.firstname, 
	CASE WHEN m1.recommendedby = 0 THEN 'Unknown'
	ELSE m2.surname END AS Recommender
FROM Members AS m1
LEFT JOIN Members AS m2
ON m1.recommendedby=m2.memid
ORDER BY m1.surname;'''

In [10]:
with engine.connect() as con:
    rs = con.execute(q11_query)
    df = pd.DataFrame(rs.fetchall())
    df.columns = rs.keys()
print(df)

              surname  firstname Recommender
0               Bader   Florence    Stibbons
1               Baker       Anne    Stibbons
2               Baker    Timothy     Farrell
3              Boothe        Tim      Rownam
4             Butters     Gerald       Smith
5              Coplin       Joan       Baker
6             Crumpet      Erica       Smith
7                Dare      Nancy    Joplette
8             Farrell     Jemima        None
9             Farrell      David        None
10              GUEST      GUEST        None
11            Genting    Matthew     Butters
12               Hunt       John     Purview
13              Jones      David    Joplette
14              Jones    Douglas       Jones
15           Joplette     Janice       Smith
16          Mackenzie       Anna       Smith
17               Owen    Charles       Smith
18             Pinker      David     Farrell
19            Purview  Millicent       Smith
20             Rownam        Tim        None
21             Rumney  Henrietta     Genting
22             Sarwin  Ramnaresh       Bader
23              Smith     Darren        None
24              Smith      Tracy        None
25              Smith       Jack       Smith
26              Smith     Darren        None
27           Stibbons     Ponder       Tracy
28              Tracy     Burton        None
29         Tupperware   Hyacinth        None
30  Worthington-Smyth      Henry       Smith

In [11]:
q12_query = '''
SELECT f.name AS 'Facility', SUM(b.slots) AS 'Slots reserved by members'
FROM Bookings AS b
LEFT JOIN Facilities AS f
ON b.facid = f.facid
WHERE b.memid !=0
GROUP BY f.name;'''

In [12]:
with engine.connect() as con:
    rs = con.execute(q12_query)
    df = pd.DataFrame(rs.fetchall())
    df.columns = rs.keys()
print(df)

          Facility  Slots reserved by members
0  Badminton Court                       1086
1   Massage Room 1                        884
2   Massage Room 2                         54
3       Pool Table                        856
4    Snooker Table                        860
5     Squash Court                        418
6     Table Tennis                        794
7   Tennis Court 1                        957
8   Tennis Court 2                        882

In [13]:
q13_query = '''
SELECT STRFTIME('%m', starttime) AS Month, SUM(slots) AS "Total slots"
FROM Bookings
WHERE memid != 0
GROUP BY Month;'''

In [14]:
with engine.connect() as con:
    rs = con.execute(q13_query)
    df = pd.DataFrame(rs.fetchall())
    df.columns = rs.keys()
print(df)

  Month  Total slots
0    07         1061
1    08         2531
2    09         3199